let dark = [  
    '1-й Івана Богуна провулок', 
    '12-а Східна вулиця', 
    'XXIV Партз’їзду вулиця', 
    'Івана Богуна вулиця', 
    'Івана Франка вулиця', 
    'Індустріальна вулиця', 
    'Інтернаціональний провулок', 
    'Артема вулиця', 
    'Бабушкіна вулиця', 
    'Бабушкіна провулок', 
    'Ватутіна провулок', 
    'Войкова вулиця', 
    'Вокзальна вулиця', 
    'Воровського вулиця', 
    'Ворошилова вулиця', 
    'Вільямса вулиця', 
    'Гастелло вулиця', 
    'Герцена вулиця', 
    'Глібка вулиця', 
    'Гоголя вулиця', 
    'Горького провулок', 
    'Дерев’янка вулиця', 
    'Дзержинського вулиця', 
    'Добролюбова вулиця', 
    'Докучаєва вулиця', 
    'Енергетична вулиця', 
    'Заньковецької вулиця', 
    'Зарічний провулок', 
    'Затонського вулиця', 
    'Західна вулиця', 
    'Західний провулок', 
    'Зорге вулиця', 
    'Зої Космодем’янської вулиця', 
    'Карла Лібкнехта вулиця', 
    'Кармелюка вулиця', 
    'Карпінського вулиця', 
    'Карпінського провулок', 
    'Київська вулиця', 
    'Коломенська вулиця', 
    'Комарова вулиця', 
    'Комуністична вулиця', 
    'Кооперативна вулиця', 
    'Короленка вулиця', 
    'Котляревського вулиця', 
    'Коцюбинського вулиця', 
    'Красіна вулиця', 
    'Кропивницького вулиця', 
    'Крупської вулиця', 
    'Кірова вулиця', 
    'Леваневського вулиця', 
    'Леніна вулиця', 
    'Леніна площа', 
    'Ломоносова вулиця', 
    'Максима Залізняка провулок', 
    'Малофонтанна вулиця', 
    'Матросова вулиця', 
    'Матросова провулок', 
    'Мельникова вулиця', 
    'Молодогвардійська вулиця', 
    'Молодогвардійський провулок', 
    'Молокова вулиця', 
    'Молокова провулок', 
    'Мопрівська вулиця', 
    'Мілованова провулок', 
    'Мічуріна вулиця', 
    'Нахімова вулиця', 
    'Некрасова вулиця', 
    'Нечуя-Левицького вулиця', 
    'Олега Кошового вулиця', 
    'Осипенка вулиця', 
    'Павлика Морозова вулиця', 
    'Павлова вулиця', 
    'Паризької Комуни вулиця', 
    'Площа Перемоги', 
    'Поріднених міст вулиця', 
    'Привокзальний провулок', 
    'Пролетарська вулиця', 
    'Пролетарський провулок', 
    'Пушкіна вулиця', 
    'Північна вулиця', 
    'Північний провулок', 
    'Піонерська вулиця', 
    'Піонтковського вулиця', 
    'Радзієвського вулиця', 
    'Республіканська вулиця', 
    'Робоча вулиця', 
    'Садовий провулок', 
    'Семеренко вулиця', 
    'Сергія Лазо вулиця', 
    'Смирнова вулиця', 
    'Старицького вулиця', 
    'Степова вулиця', 
    'Східна вулиця', 
    'Тальнівська вулиця', 
    'Тищика вулиця', 
    'Тухачевського вулиця', 
    'Урбайліса вулиця', 
    'Урицького вулиця', 
    'Урицького провулок', 
    'Ушакова вулиця', 
    'Фрунзе вулиця', 
    'Фурманова вулиця', 
    'Халтуріна вулиця', 
    'Халтуріна провулок', 
    'Червоногвардійська вулиця', 
    'Черкаська вулиця', 
    'Чернишевського вулиця', 
    'Чернишевського провулок', 
    'Черняховського вулиця', 
    'Чигиринська вулиця', 
    'Чкалова вулиця', 
    'Чкалова провулок', 
    'Шкільна вулиця', 
    'Юмашева вулиця', 
    'дачна дорога', 
];

let submit = document.getElementById('submit'),
input = document.getElementById('input'),
streettype = document.getElementById('streettype'),
output = document.getElementById('output');

submit.addEventListener('click', search);

function search(){
let result = input.value + ' ' + streettype.value;
console.log(result);
let counter = 0;
dark.forEach(item =>{
    item = item.toLowerCase();
    result = result.toLowerCase();
    if(item.includes(result)){
        counter = true;
    }
    });
if(counter == true && input.value != ''){
    output.classList.toggle('animate__bounce');
    output.innerHTML = 'Така вулиця є!';
}
else if(counter ==false && input.value != ''){
    output.classList.toggle('animate__headShake');
    output.innerHTML = 'Такої вулиці немає..';
}
else{
    output.classList.toggle('animate__headShake');
    output.innerHTML = 'Ви нічого не ввели!';
}
}

